In [ ]:
#Tugas poin 1 : Create the following Pandas DaataFrame

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    "name": ["Anna", "Dane", "David", "kevin", "Joe", "Rose"],
    "weight": [45.2,50.5,62.1,64.0,59.0,np.nan],
    "height": [155,160,162,170,167,159],
    "birth_year": [2000,1997,1996,1987,1998,2003],
    "gender": ["Female", "Male", "Male", "Male", "Male", "Female"],
    "city": ["New York", "Chicago", "Austin","New York", np.nan, "New York"]
    })
df

    name  weight  height  birth_year  gender      city
0   Anna    45.2     155        2000  Female  New York
1   Dane    50.5     160        1997    Male   Chicago
2  David    62.1     162        1996    Male    Austin
3  kevin    64.0     170        1987    Male  New York
4    Joe    59.0     167        1998    Male       NaN
5   Rose     NaN     159        2003  Female  New York

In [60]:
df["name"]

0     Anna
1     Dane
2    David
3    kevin
4      Joe
5     Rose
Name: name, dtype: object

In [61]:
df["weight"]

0    45.2
1    50.5
2    62.1
3    64.0
4    59.0
5     NaN
Name: weight, dtype: float64

In [6]:
df["birth_year"]

0    2000
1    1997
2    1996
3    1987
4    1998
5    2003
Name: birth_year, dtype: int64

In [7]:
df["height"]

0    155
1    160
2    162
3    170
4    167
5    159
Name: height, dtype: int64

In [8]:
df["gender"]

0    Female
1      Male
2      Male
3      Male
4      Male
5    Female
Name: gender, dtype: object

In [9]:
df["city"]

0    New York
1     Chicago
2      Austin
3    New York
4         NaN
5    New York
Name: city, dtype: object

In [10]:
df = pd.DataFrame([["Anna", 45.2, 155, 2000, "Female", "New York"],
                  ["Dane", 50.5, 160, 1997, "Male", "Chicago"],
                  ["David", 62.1, 162, 1996, "Male", "Austin"],
                  ["kevin", 64.0, 170, 1987, "Male", "New York"], 
                  ["Joe", 59.0, 167, 1998, "Male", np.nan],
                  ["Rose", np.nan, 159, 2003, "Female", "New York"]],
                  columns = ["name", "weight", "height", "birth_year", "gender", "city"])
df

    name  weight  height  birth_year  gender      city
0   Anna    45.2     155        2000  Female  New York
1   Dane    50.5     160        1997    Male   Chicago
2  David    62.1     162        1996    Male    Austin
3  kevin    64.0     170        1987    Male  New York
4    Joe    59.0     167        1998    Male       NaN
5   Rose     NaN     159        2003  Female  New York

In [11]:
#Tugas 2 : create another Pandas DataFrame as the following and merge it with the previous DataFrame (key=name and nick name). 
#Make sure that no rows are missing from the original DataFrame

In [14]:
df_nickname = pd.DataFrame({
        "nick_name": ["Anna", "Dane", "David", "Rose"],
        "full_name": ["Anna Levis", "Dane John", "David Sebastian", "Rose Kimberly"]
    })
df_merged = df.merge(
    df_nickname, how = "outer", left_on = "name", right_on = "nick_name")
df_merged

,name,weight,height,birth_year,gender,city,nick_name,full_name
0,Anna,45.2,155,2000,Female,New York,Anna,Anna Levis
1,Dane,50.5,160,1997,Male,Chicago,Dane,Dane John
2,David,62.1,162,1996,Male,Austin,David,David Sebastian
3,kevin,64.0,170,1987,Male,New York,NaN,NaN
4,Joe,59.0,167,1998,Male,NaN,NaN,NaN
5,Rose,NaN,159,2003,Female,New York,Rose,Rose Kimberly

In [12]:
#Tugas 3 : Drop nick_name column and fill null values in the full_name from the merged DataFrame with their original name column.

In [15]:
del df_merged["nick_name"]
df_merged["full_name"].fillna(df["name"], inplace = True)
df_merged

    name  weight  height  birth_year  gender      city        full_name
0   Anna    45.2     155        2000  Female  New York       Anna Levis
1   Dane    50.5     160        1997    Male   Chicago        Dane John
2  David    62.1     162        1996    Male    Austin  David Sebastian
3  kevin    64.0     170        1987    Male  New York            kevin
4    Joe    59.0     167        1998    Male       NaN              Joe
5   Rose     NaN     159        2003  Female  New York    Rose Kimberly

In [ ]:
#Tugas 4 : Create a new ‘bmi’ column calculated based on the following formula

In [62]:
a = df["weight"]
b = df["height"]
bmi = a/((b/100)**2)
df_bmi = pd.DataFrame({
        "name": ["Anna", "Dane", "David", "kevin", "Joe", "Rose"],
        "BMI": bmi
        })
df_bmi

    name        BMI
0   Anna  18.813736
1   Dane  19.726562
2  David  23.662551
3  kevin  22.145329
4    Joe  21.155294
5   Rose        NaN

In [54]:
#Tugas 5 : Create a new bmi_class column following the definition in the table

In [67]:
list_bmi = []

k = 0
x = ""
for i in range(len(df["weight"])):
    a = df._get_value(k, "weight")
    b = df._get_value(k, "height")
    bmi = a/((b/100)**2)

    if bmi < 18.5:
        x = "Underweight"
    elif bmi < 25:
        x = "Normal Weight"
    elif bmi < 30:
        x = "Overweight"
    elif bmi < 35:
        x = "Obesity Class 1"
    elif bmi < 40:
        x = "Obesity Class 2"
    elif bmi >= 40:
        x = "Obesity Class 3"
    else:
        x = "Error"

    list_bmi.append(x)
    k += 1

df_bmi = pd.DataFrame({
        "BMI": list_bmi
    })
df_result = pd.concat([df_merged, df_bmi], axis = 1)
print(result)

    name  weight  height  birth_year  gender      city        full_name  \
0   Anna    45.2     155        2000  Female  New York       Anna Levis
1   Dane    50.5     160        1997    Male   Chicago        Dane John
2  David    62.1     162        1996    Male    Austin  David Sebastian
3  kevin    64.0     170        1987    Male  New York            kevin
4    Joe    59.0     167        1998    Male       NaN              Joe
5   Rose     NaN     159        2003  Female  New York    Rose Kimberly

             BMI
0  Normal Weight
1  Normal Weight
2  Normal Weight
3  Normal Weight
4  Normal Weight
5          Error